'number' + 3 + 3 // ‘number33’ -> перша змінна рядок, тому відбувається конкатенація (злиття)
null + 3 // 3 -> null відображає пусте значення, після додавання лишиться лише 3 
5 && "qwerty" // “qwerty” -> при двох значеннях true оператор ТА залишає останнє значення не false
+'40' + +'2' + "hillel"; // “42 hillel” -> унарний + переводить в числове значення, а результат 42 з'єднується з рядком
'10' - 5 === 6; // false -> 1 не дорівнює 6
true + false // 1 -> неявне перетворення значення boolean в число 1+0=1
'4px' - 3 // Nan -> через наявність літер '4px' не є число
'4' - 3 // 1 -> неявне перетворення строки в число
'6' + 3 ** 0;  // '61' -> конкатенація 6 та 3 в 0 ступені (1)
12 / '6' // 2 -> неявне перетворення
'10' + (5 === 6); // '10false' -> конкатенація 10 та false
null == '' // false -> обидва значення мають запис об'єкта, але тільки "" має визначену кількість пам'яті
3 ** (9 / 3); // 27 -> 3 в ступені 3
!!'false' == !!'true'  // true -> !! переводить до значення boolean, і обидві частини = true
0 || '0' && 1 // 1 -> в першому порівнянні АБО лишається '0', а в другому останнє не false значення
(+null == false) < 1; // false -> в дужках 0 = 0 значить true, а true (1) не є більшою 1 
false && true || true // true -> в першому порівнянні ТА лишається false, в другому АБО лишається true
false && (false || true); // false -> в дужках лишається true, при ТА лишається false
(+null == false) < 1 ** 5; // false -> в дужках true (0=0), а true (1) не є більшою 1 в 5 ступені (1)